Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: The YYC takes the normal GameMaker: Studio output and then compiles that into native code for the target platform, "stripping out" unneeded functions and performing a host of other optimisation techniques to create a smaller and performance enhanced executable.
zh_cn: YYC 使得普通的 GameMaker: Studio 输出并编译为目标平台的代码，“剥离” 不需要的函数，进行一系列技术优化，然后创建一个更小的、性能更强的执行程序。

source: The YoYo Compiler (YYC)
zh_cn: The YoYo Compiler (YYC) 模块

source: The above code check for a key press and the toggle the application surface on or off depending on its state (like in an options menu).
zh_cn: 上述代码检测按键并根据它的状态切换应用表面的启用(就像菜单的选项)。

source: The above code checks a variable and if it resolves to true, then it exists the code block, otherwise it goes ahead and runs the rest of the code.
zh_cn: 上述代码检测一个变量，如果为真它将退出代码块，否则继续运行后面的代码。

source: The above code checks for a key press and if it detects one it frees the memory reserved for the surface indexed in the variable "surf" and then changes room.
zh_cn: 上述代码将检测一个键是否按下，如果检测到了，则对索引为变量surf的表面图层所预留的那部分内存进行释放，然后切换一个房间。

source: The above code checks for a mouse button press and then sets the window to fullscreen if it is not already, or sets it to windowed if it is already.
zh_cn: 上述代码将检测鼠标按下，如果还不是全屏则设置窗口为全屏，否则在已经是全屏模式时设置为窗口。

source: The above code checks the orientation of the device and sets a global variable depending on the value returned.
zh_cn: 上述代码检测设备的取向，根据返回值设置一个全局变量。

source: The above code checks to make sure that the correct asynchronous function call is being revised, then goes on to get the status of the returned cloud ds_map.
zh_cn: 上面的代码通过检查以确保异步调用的函数正确性，然后返回云端 ds_map 的 status。

source: The above code checks to see if a surface exists and if it does not it will create a surface that is 1024 pixels wide and 1024 pixels high, assigning the index to the variable "surf".
zh_cn: 上述代码将检测是否存在一个表面图层，如果没有则创建一个1024×1024px大小的表面图层，并指定给索引为变量“surf”。

source: The above code checks to see if an instance of the object "obj_Player" exists and if it does, it sets view[0] to follow that instance.
zh_cn: 上述代码将检测如果物体 “obj_Player”存在一个实例，它将设置 view[0] 跟随那个实例。

source: The above code checks to see if view[0] is visible or not and if it is not, it then sets it to be visible.
zh_cn: 上述代码检测 view[0] 是否可见，如果不可见，则设置为可见。

source: The above code checks to see if views are enabled for the room, and if they are not, it makes sure that view[0] is visible and then enables views for the room.
zh_cn: 上述代码将检测房间视野是否开启，如果没有则让视野可见并启用视野。

source: The above code checks to see which view is currently being drawn and then draws a different text to each view based on the return value.
zh_cn: 上述代码将基于返回值检测当前绘制的是哪个视野并绘制不同的文字。

source: The above code creates a ds_map and then requests data for the first available notification in the queue.
zh_cn: 上面的代码创建了一个 ds_map ，然后请求数据队列中第一个可用的通知。

source: The above code creates a new ds_grid, based on the width and height of a previously created grid, then copies the information form the previous grid to the new one.
zh_cn: 上述代码创建了一个新的栅格结构，基于先前创建的栅格的宽度和高度，然后从先前的栅格中拷贝信息给新的栅格。

source: The above code creates a string from the values stored in the global array "Highscores" and then writes this string to a file for local storage.
zh_cn: 以上的代码创建了一个字符串的值存储在全局数组“Highscores”中,然后将该字符串写入本地存储。

source: The above code creates a string from the values stored in the global array "Highscores" and then writes this string to the cloud service for storage, as well as writing it to a file for local storage.
zh_cn: 以上的代码创建了一个字符串的值存储在全局数组“Highscores”中,然后将该字符串写入存储的云服务中,并且在本地文件中保存了一份。

source: The above code creates two surfaces of different sizes, assigning each one to a different canvas element, and then those surfaces are assigned to two views so that the correct part of the room is captured.
zh_cn: 上述代码创建了两个不同大小的表面，并给他们每个都指定了不同的画布元素，然后为了在房间里捕捉正确的部分，给这两个表面层指定了两个视野。

source: The above code first checks the current draw alpha and then if it is not set to 1 it sets it to 1.
zh_cn: 上述代码首先检测当前绘制透明度，当其不为1时，将其设为1。

source: The above code gets the hue used to make the colour constant "c_teal" and then merges it with white at a 50:50 ratio, storing the resulting colour in the variable "col".
zh_cn: 上述代码获取常量 "c_teal"的色相，然后将其与白色按照50：50的比例混合，并且将混合后的新颜色储存到变量 "col"中。

source: The above code gets the saturation used to make the colour constant "c_teal" and then uses that value to set a random colour to have the same saturation, storing the resulting colour in the variable "col".
zh_cn: 上述代码获取常量 "c_teal"的饱和度，然后使用这个饱和度与一个随机的颜色相搭配，并且将得到新颜色储存到变量 "col"中。

source: The above code gets the value used to make the colour constant "c_teal" and then uses that value to set a random colour to have the same luminosity, storing the resulting colour in the variable "col".
zh_cn: 上述代码获取常量 "c_teal"的明度，然后使用这个明度与一个随机的颜色相搭配，并且将得到新颜色储存到变量 "col"中。

source: The above code initialises a for loop, starting at 0 and counting up until 9, and then uses the loop value of "i" to draw the values stored in an array down the screen.
zh_cn: 上述代码初始化“i”用于循环，始于0累计至9，使用循环值“i”在屏幕上绘制数组的值。

source: The above code resets the position of view port[0] to the (0,0) position (top left hand corner) of the display.
zh_cn: 上述代码将重设view port[0]（视口）的位置为 显示器的(0,0)位置 (左上角)。

source: The above code sets the speed of the view following to be the same as the currently selected follow object.
zh_cn: 上述代码设置视野的移动速度与跟随的物体的速度一致。

source: The above code sets the width and height of the view to be the same as the width and height of the view port.
zh_cn: 上述代码将设置视野的宽高与视口的一致。

source: The above code stores the current x axis window position in the variable "wx".
zh_cn: 上述代码储存当前窗口位置的x坐标至变量wx。

source: The above code stores the current x axis window position of the mouse in the variable "wx".
zh_cn: 上述代码储存当前窗口内的鼠标x轴坐标至变量“wx”。

source: The above code stores the current y axis window position in the variable "wy".
zh_cn: 上述代码储存当前窗口位置的y坐标至变量wy。

source: The above code stores the current y axis window position of the mouse in the variable "wy".
zh_cn: 上述代码储存当前窗口内的鼠标y轴坐标至变量“wy”。

source: The above code takes a screenshot of a part of the game screen that is 100 pixels square when the user presses the "S" key.
zh_cn: 上述代码在按下“S”键时将游戏屏幕边长100像素的正方形区域保存为截图。

source: The above code takes a screenshot of the game when the user presses the "S" key.
zh_cn: 上述代码在按下“S”键时保存游戏屏幕截图。

source: The above code uses "switch" to check for a keyboard event and then compares that to the cases listed.
zh_cn: 上述代码使用“switch”检测键盘事件，然后和条件列表比较。

source: The above code will add up all the values in our array, draw each of them and draw the total value at the end.
zh_cn: 这段程序将数组中的数据依次累加，并绘制数组的值每个值，最后绘制累加的总和。

source: The above code will center the game window within the display if it is not in full screen mode.
zh_cn: 在不是全屏模式下的情况下，让游戏窗口屏幕居中放置。

source: The above code will change the size of the window based on the value of the variable "global.scale" when the mouse button is pressed.
zh_cn: 上述代码将在鼠标按下时，基于变量“global.scale”改变窗口的大小。

source: The above code will change the window cursor to the standard windows drag cursor if the left mouse button has been pressed and it has not already been changed previously.
zh_cn: 如果之前不是拖放指针，上述代码将在按下鼠标左键时切换窗口鼠标指针为拖放指针。

source: The above code will change the window cursor to the standard windows drag cursor if the left mouse button has been pressed.
zh_cn: 上述代码在鼠标左键按下时改变窗口光标为拖动光标。

source: The above code will check for a mouse button being pressed, and if it is it then gets the mouse position relative to the view[0] and compares it to see if a variable should be set to true.
zh_cn: 上述代码将检测鼠标是否按下，如果是，然后它会获取相对于视野0（view[0]）的鼠标位置，并且比较它的值，看是否应该设置为真。

source: The above code will check the current geometry method and set it to "fast" if it is not already.
zh_cn: 上述代码将检测当前的几何顶点缓冲区的方法，如果没有准备好则设置为 “fast（vbm_fast 方法）”。

source: The above code will check the current view being drawn and if it is view[0] it copies the surface indexed in the variable "temp_surf" onto the surface indexed in the variable "surf".
zh_cn: 上述代码将检测当前绘制的视野，如果视野是 view[0]，则复制变量为 "temp_surf" 的表面到变量为 "surf"的表面。

source: The above code will check the view port size against that of the surface "aplication_surface" and if it is different, the surface is re-sized.
zh_cn: 上述代码将检测视野输出大小是否与“应用表面”的一致，如果不同，将重置表面层的大小。

source: The above code will check the window colour to see if it is set as black or not, and if it is not it sets it to black.
zh_cn: 上述代码检测窗口内背景颜色，如果不是黑色则设置为黑色。

source: The above code will check the windows caption to see if it has text or not, and if it does it sets it to an empty string so as no caption is displayed.
zh_cn: 上述代码检测窗口是否有标题文字，如果有则设置为空，即不显示标题。

source: The above code will check to see if a surface indexed in the variable "surf" exists, and if it does not, it will re-create it.
zh_cn: 上面的例子中将检测变量为 "surf"的表面图层是否存在，如果不存在，将重新创建一个。

source: The above code will check to see if the game window is in focus or not, and if the function returns false a script will be called.
zh_cn: 上述代码将检测游戏窗口是否是焦点，如果返回 false，则调用一个脚本。

source: The above code will check to see if the user presses the "S" key on the keyboard and if they do it will save a part of the surface indexed in the variable "surf" to disc.
zh_cn: 上面的代码将检查是否用户按下键盘上的“S”键，如果他们这样操作了，将对变量“surf”索引的表面层的一部分进行存盘保存。

source: The above code will check to see if the user presses the "S" key on the keyboard and if they do it will save the surface indexed in the variable "surf" to disc.
zh_cn: 上面的代码将检查是否用户按下键盘上的“S”键，如果他们这样操作了，将对变量“surf”索引的表面层存盘保存。

source: The above code will check to see if the v-sync method is using the alternative or the default, and if it's the default it will switch to the alternative instead.
zh_cn: 上述代码检测是否使用于替代的垂直同步方法，如果是默认的则切换为替代的方法。

source: The above code will check to see if the window is in full screen mode or not and draw a text message depending on the returned value.
zh_cn: 上述代码将检测是否为窗口模式，根据返回的值绘制文字。

source: The above code will check to see which view is currently being drawn, and if it is view[0] it sets the draw target to a surface and draws all instances of the object "obj_Effect" before resetting the draw target again.
zh_cn: 上述代码将检测当前是哪个视野在绘制，如果是view[0] ，它将设置绘制目标到一个表面层，并在表面层上绘制“obj_Effect”所有实例 ，然后重置绘制目标。

source: The above code will draw the score at a position relative to the x and y coordinates of view[0].
zh_cn: 上述代码将在相对于视野0（ view[0]）的x、y坐标的一个位置绘制分数。

source: The above code will generate a 1D array held in the variable display_data containing the information about the displays, as well as create the variable display_num to hold the number of active displays found.
zh_cn: 上述代码将生成一个包含显示器信息的一维数组保存到变量 display_data，同时创建变量 display_num 保存找到的激活的显示器的数目。

source: The above code will get the 32bit colour value at the position of the mouse and then split it into its component values, storing them in variables.
zh_cn: 上述代码将获取鼠标位置的32位真颜色，提取它的分量值，储存到不同的变量上。

source: The above code will get the angle of direction from the instance to the mouse cursor, then get the difference between that angle and the current image_angle, using this value to slowly rotate towards the mouse.
zh_cn: 上述代码将会获得实例到鼠标光标的方向角，然后获得这个角度与当前的image_angle的差值，同时使用这个值缓慢地向鼠标方向旋转。

source: The above code will get the blue component of the colour constant "c_teal" and store the value in the variable "b_comp".
zh_cn: 上述代码获取常量 "c_teal"的蓝色值，并且将其储存到变量 "b_comp"中。

source: The above code will get the green component of the colour constant "c_teal" and store the value in the variable "g_comp".
zh_cn: 上述代码获取常量 "c_teal"的蓝色值，并且将其储存到变量 "g_comp"中。

source: The above code will get the position of the application surface, as well as the absolute width and height in relation to the display window, and store them in four variables for future use.
zh_cn: 上述代码获取应用表面层的位置，以及相对于显示器或窗口的绝对长宽值，保存到四个变量上备用。

source: The above code will get the red component of the colour constant "c_teal" and store the value in the variable "r_comp".
zh_cn: 上述代码获取常量 "c_teal"的红色值，并且将其储存到变量 "r_comp"中。

source: The above code will lock the draw GUI event to the given width and height, scaling all components to fit either the application surface, or the display, using that proportion.
zh_cn: 上述代码将锁定GUI绘制事件，以指定的宽度和高度，使用那个比例缩放所有的分量以适应应用表面或者显示器。

source: The above code will lock the draw GUI event to the given width and height, scaling all components to fit the display, using that proportion.
zh_cn: 上述代码将锁定GUI绘制事件，以指定的宽度，使用那个比例缩放所有的分量以适应显示器。

source: The above code will position the game window in the upper left corner of the browser or display (depending on the target module being used).
zh_cn: 上述代码将放置游戏窗口至浏览器或者显示器（根据正在使用的目标模块）的左上角。

source: The above code will resize the application surface to have a 1:1 ratio with the GUI layer.
zh_cn: 上述代码在GUI层上以1:1的比例重置应用表面层的大小。

source: The above code will resize the ds_grid indexed in the global variable "Grid" and then clear it so that each cell holds the value -1.
zh_cn: 上述代码将会重设索引为全局变量"Grid"的栅格结构的大小，并且接下来清空它以便每个单元个都承载值-1.

source: The above code will scale the view width and height based on the ratio of the view port width and height.
zh_cn: 上述代码将基于视口宽高比，缩放视野宽高。

source: The above code will set an advert to display at the bottom left-hand corner of the display.
zh_cn: 上述代码在显示器底部左下角设置并显示一个广告。

source: The above code will set an advert to display at the top right-hand of the display.
zh_cn: 上述代码将在显示器右上角设置并显示一个广告。

source: The above code will set the anti-aliasing level to 8 if supported and switch v-sync to on.
zh_cn: 上述代码将设置抗锯齿等级为8，并开启垂直同步。

source: The above code will set the game window to occupy the whole display area (either the browser or the screen, depending on the target platform).
zh_cn: 上述代码将设置游戏窗口覆盖整个显示器区域（可以是浏览器或者屏幕，取决于目标平台）。

source: The above code will set the minimum and maximum width and height for the game window.
zh_cn: 上述代码将为游戏窗口设定最大宽高。

source: The above code will set the render target 0 to the surface ID indexed in the variable "surf".
zh_cn: 上述代码将渲染目标0到变量“surf”索引的表面层上。

source: The above code will set the view follow borders to half the width and height of the view, effectively forcing the view to always be centered on the follow object.
zh_cn: 上述代码将设置视野跟随边界为视野宽度和高度的一半，有效的迫使跟随的物体保持在视野的中心。

source: The above code will skip back to the beginning of the loop if the array[i] value is already an empty string.
zh_cn: 上述代码将判断array[i]的值，如果是一个空字符，它将跳回到循环的开始。

source: The above code will store the current window height in the variable "hh".
zh_cn: 上述代码将获取当前窗口的高度，保存到变量"hh"中。

source: The above code will store the current window width in the variable "ww".
zh_cn: 上述代码将保存当前窗口的宽度到变量“ww”中。

source: The above code will store the d3d device pointer in a variable.
zh_cn: 上述代码在一个变量中保存d3d设备的指针。

source: The above code will store the game window id in a variable.
zh_cn: 上述代码将在变量中保存游戏窗口的id。

source: The above code will store the height of the surface indexed in the variable "surf" in the variable "sh".
zh_cn: 上述代码将在变量sh中储存索引变量为surf的表面图层的高度。

source: The above code will store the width of the surface indexed in the variable "surf" in the variable "sw".
zh_cn: 上述代码将在变量sw中储存索引变量为surf的表面图层的宽度。

source: The above code will switch off the automatic drawing of the application surface.
zh_cn: 上述代码将切换应用表面层的自动绘制为假。

source: The above code would center the mouse in the game display.
zh_cn: 上述代码将鼠标放置在显示器中央。

source: The above code would center the mouse in the game window.
zh_cn: 上述代码将鼠标在游戏窗口中居中放置。

source: The above program tries to place the current object at a free position (this is about the same as the action to move an object to a random position).
zh_cn: 上述代码尝试去在一个空闲位置放置当前的实例（这和动作 移动物体至随机位置结果相似）。

source: The above rules for file types are for the default configuration of Uncompressed audio.
zh_cn: 上述文件类型是 Uncompressed (未压缩) 音频的默认配置。

source: The actual Debug Module window will look something like this:
zh_cn: 调试模块窗口看起来像这样：

source: The actual files produced will depend on the target module chosen in the drop down menu of the GameMaker: Studio GUI.
zh_cn: 产生的实际文件取决于 GameMaker: Studio GUI 界面选择的模块。

source: The actual game you create happens in a window, and this window has a number of properties, like whether it has a border, whether it is full screen, etc.
zh_cn: 你创建的游戏实际上是在窗口中运行，而窗口有许多属性，比如是否有边框，是否全屏等。

source: The actual sequence of events is as follows:
zh_cn: 实际的事件序列如下所示：

source: The actual structure of the program can vary greatly, depending on the functions it uses, but broken down to basics it just looks like this:
zh_cn: 程序的结构可以千差万别，但最基本的通常都像下面这样：

source: The available anti-aliasing levels are 0,2,4 and 8, with the default startup value being set to 0, and the default v-sync setting is false (off).
zh_cn: 可用的抗锯齿等级包括0、2、4和8，默认起动时设置为0，默认的 v-sync（垂直同步）设置为关闭 (假)。

source: The available target modules are:
zh_cn: 现有的目标模块:

source: The basic idea is rather simple - you define a path by drawing it in the path editor, then you can place an action (or code) in the creation event of an object to tell the object to follow that particular path.
zh_cn: 路径的基本理念非常简单——通过在路径编辑器中绘制一条路径，你就可以在一个物体的创建事件中添加一个动作（或者用代码）来让这个物体沿着某个特定路劲运动。

source: The basic use of a surface would be as follows - You first create a surface and assign its index to a variable.
zh_cn: 表面层的基本用法如下 - 首先创建一个表面，给它的索引分配给一个变量。

source: The bottom edge of the rectangle to check.
zh_cn: 矩形的底部边界。The bottom edge of the rectangle to check.

source: The bottom position of the region of cells to copy from the source grid.
zh_cn: 从源栅格复制的单元格区域的底端位置

source: The buffer method to use (see the constants list below).
zh_cn: 准备使用的缓冲区方法（查看下面所列的常量）。

source: The button Show Information gives an overview of all information for the object that can also be printed out or saved as an HTML file.
zh_cn: Show Information 按钮是物体的概述，可以打印或另存为 HTML 文档。

source: The code below gives a simple example of this:
zh_cn: 下面的代码给出了一个简单的例子：

source: The colour to set the region.
zh_cn: 颜色，用于设置那块区域。

source: The colour with which the screen will be cleared
zh_cn: 用来填充屏幕的颜色

source: The connection kind can be either straight line, or smooth where a straight line connect simply connects the points of a path in a linear basis, with angular changes at each point, while a smooth connection will create a much softer path that may not pass directly through any of the points, but rather take an approximate line, creating nice curves.
zh_cn: 连接方式可以是线段或者是平滑。如果设置为线段方式，那么路径只是简单的用直线依次连接每一个点，路径的方向只在每个连接点处才会改变；而如果使用平滑方式，那么系统会根据你的点创建一条更加平滑的曲线路径。

source: The constants available are:
zh_cn: 可用的常量如下：

source: The continue statement has the form:
zh_cn: “continue”语句的结构：

source: The cursor to set for the game window.
zh_cn: 为游戏窗口设置的光标。.

source: The data package to send to your game (a string)
zh_cn: 发送到游戏的数据包 (字符串格式)

source: The data string to be uploaded.
zh_cn: 将要被上传的字符串。

source: The date/time to fire the off the notification
zh_cn: 触发通知的日期/时间。

source: The debug output would be 1 and 3.
zh_cn: 调试输出将会有1和3。

source: The default angle is 0º but it can be set to any angle between -359º and 359º.
zh_cn: 默认角色是 0º，但是可以设置为-359º 与 359º之间的任意角度。

source: The description should be a short string of information that describes the save, eg: "Level2, Stage2".
zh_cn: 描述文字应该尽量的短，用于描述保存操作, 例如： "Level2, Stage2".

source: The device is being held horizontally ie: The longest edge is from left to right, and the menu button is on the right.
zh_cn: 横向放置设备，如： 拥有从左到右最长的边缘，菜单按钮是在右边。

source: The device is being held vertically ie: The longest edge is from top to bottom, and the menu button is at the bottom.
zh_cn: 纵向放置设备 如：从顶部到底拥有最长的边缘，菜单在底部。

source: The different target compilers will perform the operations in different orders since they are not explicitly shown, giving rise to "odd" results that you may not expect when you play your game.
zh_cn: 不同平台的编译器用不同的顺序执行运算，如果没有明确体现，可能会导致得出一个奇怪的结果，而影响游戏的体验。

source: The draw alpha affects the transparency of all draw functions, and can be set with the draw_set_alpha function.
zh_cn: 这个绘制透明度会影响所有的绘制函数，你可以使用 draw_set_alpha 函数来修改它。

source: The drawing target is then set to the new surface, which is cleared and made transparent before having the drawing target reset to the display.
zh_cn: 然后绘制目标设置给这个新的表面图层，接下来是清除表面，设置为透明，再是将绘制目标设置给显示器。

source: The ds_map will hold the following key/value pairs:
zh_cn: ds_map 将包含以下的键值对儿（key/value pairs）：

source: The edit menu contains a number of commands that relate to the resource currently selected from the resource tree on the left of the main screen (object, sprite, sound, etc.).
zh_cn: 编辑菜单包含了涉及到资源树 (物体、精灵、声音等) 的命令，

source: The exact meaning of the returned "status" map entry is explained in the following table:
zh_cn: 返回值 "status" 的详细映射关系如下如下：

source: The example code below shows a typical use of this command in the draw event of an instance to check for a surface and re-create it if it has been removed (note that the surface will have been originally created in the create event of the object).
zh_cn: 下面是这个命令在实例绘制事件中检测表面图层的典型使用，如果发现被破坏了就会重新创建（注意，表面将在创建事件中提前创建好）。

source: The execution continues after the first case statement with the correct value, until a break statement is encountered.
zh_cn: 遇到第一个正确的值后运行会继续，直到出现一个“break”语句。.

source: The exit statement has the form:
zh_cn: “exit”语句的结构：

source: The export file type is chosen from a drop-down menu within the "Save" dialogue itself, as shown by the image below:
zh_cn: 导出文件类型在 "保存" 对话框的下面选择，如下图:

source: The expression tests whether the loop should be ended.
zh_cn: 表达式测试是否结束循环。

source: The extended example below shows a basic setup for capturing a view and drawing it in the Draw GUI event, and for more information on surfaces see the section Reference - Surfaces.
zh_cn: 下面的扩展例子捕捉视野并在 Draw GUI 事件中绘制的基本设置，更多表面的信息查看章节 Reference - Surfaces。

source: The file is then sent to the cloud service for storage.
zh_cn: 该文件之后被提交到云端服务器中存储。

source: The file to be uploaded (as a string).
zh_cn: 将被上传的文件(同i符串)。

source: The file will be saved to the working directory of the game, which in windows is located at "C:\Users\YOURUSERNAME\AppData\Local\YOURGAMENAME\" This is an image of the whole display region and not just a specific section or view and your are saving out what is being drawn to the back buffer at the time, meaning that depending on where you call the function the results will differ.
zh_cn: 文件将被保存到游戏的工作目录，windows系统是在 "C:\Users\YOURUSERNAME\AppData\Local\YOURGAMENAME\"，保存的是整个 显示区域的图片，而不仅仅是一个特定的部分或者视野，并且保存的是绘制到背景缓冲区那时间的绘制的内容，这意味着根据调用这个函数的位置绘制的内容会有所区别。

source: The filename for the screenshot to save
zh_cn: 屏幕截图保存的名称。

source: The final icon permits the debug window to update its data in real time, so you can see how variables change or instances are created and destroyed as it happens.
zh_cn: 最后的这个图标允许调试窗口实时更新数据，这样的话你就能看见变量如何改变或者实例如何生成与破坏的了。

source: The first angle to use.
zh_cn: 待使用的第一个角。

source: The first is the button marked From Code.
zh_cn: 首先是标记为 From Code 的这个按钮。

source: The first room to be shown is always the first room in the main list of rooms and it will be run at the start.
zh_cn: 第一个显示的房间是主列表里的第一个房间，它将在启动时显示。

source: The first statement initializes the for-loop.
zh_cn: 语句1初始化，用于循环。

source: The first three buttons are used to control your game, permitting you to start, stop and pause it at any time.
zh_cn: 前三个按钮用来控制你的游戏，允许你在任意时刻开始停止或者暂停。

source: The flag will be either true (enabled, the default value) or false (disabled).
zh_cn: 标识可以为 真 (允许，默认值) 或 假 (不允许)。

source: The following buttons are available in this window to enable you to add, remove and change moments within the time line resource that you have created:
zh_cn: 在窗口中还有几个按钮让你来添加、删除和更改时间轴中的时刻：

source: The following code is an example of how this should be written:
zh_cn: 下面的代码解释了怎么写：

source: The following dialogue will show you the progress: Once all game details have been downloaded the previous "Update Game" button will now show a drop-down list of all of your games.
zh_cn: 下面的对话框会显示进度: 一旦所有游戏细节被下载，"Update Game" 按钮会显示你所有游戏的下拉列表。

source: The following examples illustrate this...
zh_cn: 下面举例说明这点……
